/* 
练习2-15 
本题要求编写程序,计算序列 1 - 1/4 + 1/7 - 1/10 + ... 的前N项之和。
求简单交错序列前N项和 
*/
/*
思路一：循环累加过程中乘以符号变量(加入变量值在循环过程中改变正负数，奇数项符号为正，偶数项符号为负)
*/
/* 
思路二：分别把正数项、负数项作和，然后再正数项和负数项的结果再作和
*/
#include <stdio.h>
int main(void){
	
	/* 解法一： 增加符号变量
	int n; // 项数
	int m = 1; // 奇数默认分母
	int sym = 1; // 符号，默认为正1
	double sum = 0; // 接收累加结果

	printf("求数列 1 - 1/4 + 1/7 - 1/10 + ... 的前N项之和，输入N:");
	scanf("%d", &n);
	
	// 重复，有规律
	for(int x = n; x > 0; x--){	
		sum += sym*1.0/m;
		sym *= -1; 
		m += 3;
	}
	
	printf("sum = %.3lf", sum);
	*/

//--------------------------------------------------------------------------------------------------------------------

	// 解法二：正数项、负数项的和作和
	int n; // 项数
	double sum = 0;// 接收累计结果
	int m = 0;// 奇数默认分母值
	int m1 = 4;// 偶数默认分母值 

	double sum1 = 1;

	printf("求数列 1 - 1/4 + 1/7 - 1/10 + ... 的前N项之和，输入N:");
	scanf("%d", &n);

	// 重复，有规律
	for(int x = n; x > 0; x--){
		// 选出偶数项，负数求和
		if(x % 2 == 0){
			sum += -1.0*m1;	// 项数为4时
					// R1 SUM == -4   M1 == -7 
					// R2 SUM == -4   M1 == -10
					// R3 SUM == -14 M1 == -13
					// R4 SUM == -14 M1 == -16
		}
		m1 += 3;		
	}
	
	for(int x = n; x > 0 ; x--){
		// 选出奇数项，正数求和
		if(x % 2 != 0){
			sum1 += m;
		}
		m += 3;
		printf("%.3lf %d\n", sum1, m);
	}

	// printf("sum = %.3lf %.3lf", sum, sum1);
	return 0;
}